SELECT Н_УЧЕНИКИ.ГРУППА, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, 
Н_ЛЮДИ.ОТЧЕСТВО, Н_УЧЕНИКИ.П_ПРКОК_ИД 
FROM Н_УЧЕНИКИ 
INNER JOIN Н_ЛЮДИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ЛЮДИ.ИД 
WHERE Н_УЧЕНИКИ.ПРИЗНАК = 'отчисл' 
AND Н_УЧЕНИКИ.КОНЕЦ > '2012-09-01' 
AND EXISTS(
	SELECT 1 
	FROM Н_ПЛАНЫ 
	WHERE Н_ПЛАНЫ.ИД = Н_УЧЕНИКИ.ПЛАН_ИД
    AND EXISTS(
		SELECT 1
		FROM Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ 
		WHERE Н_НАПРАВЛЕНИЯ_СПЕЦИАЛ.ИД = Н_ПЛАНЫ.НАПС_ИД
        AND EXISTS(
			SELECT 1
			FROM Н_НАПР_СПЕЦ 
			WHERE НАИМЕНОВАНИЕ = 'Программная инженерия'
            AND Н_НАПР_СПЕЦ.ИД = НС_ИД
		)
	)
);